espressif/esp-idf/components/soc/esp32s31/register/soc/hp_mem_apm_reg.h
/** HP_MEM_APM_REGION4_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION4_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x3c)
/** HP_MEM_APM_REGION4_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_X    (BIT(0))
#define HP_MEM_APM_REGION4_R0_X_M  (HP_MEM_APM_REGION4_R0_X_V << HP_MEM_APM_REGION4_R0_X_S)
#define HP_MEM_APM_REGION4_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_X_S  0
/** HP_MEM_APM_REGION4_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_W    (BIT(1))
#define HP_MEM_APM_REGION4_R0_W_M  (HP_MEM_APM_REGION4_R0_W_V << HP_MEM_APM_REGION4_R0_W_S)
#define HP_MEM_APM_REGION4_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_W_S  1
/** HP_MEM_APM_REGION4_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 4.
 */
#define HP_MEM_APM_REGION4_R0_R    (BIT(2))
#define HP_MEM_APM_REGION4_R0_R_M  (HP_MEM_APM_REGION4_R0_R_V << HP_MEM_APM_REGION4_R0_R_S)
#define HP_MEM_APM_REGION4_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R0_R_S  2
/** HP_MEM_APM_REGION4_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_X    (BIT(4))
#define HP_MEM_APM_REGION4_R1_X_M  (HP_MEM_APM_REGION4_R1_X_V << HP_MEM_APM_REGION4_R1_X_S)
#define HP_MEM_APM_REGION4_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_X_S  4
/** HP_MEM_APM_REGION4_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_W    (BIT(5))
#define HP_MEM_APM_REGION4_R1_W_M  (HP_MEM_APM_REGION4_R1_W_V << HP_MEM_APM_REGION4_R1_W_S)
#define HP_MEM_APM_REGION4_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_W_S  5
/** HP_MEM_APM_REGION4_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 4.
 */
#define HP_MEM_APM_REGION4_R1_R    (BIT(6))
#define HP_MEM_APM_REGION4_R1_R_M  (HP_MEM_APM_REGION4_R1_R_V << HP_MEM_APM_REGION4_R1_R_S)
#define HP_MEM_APM_REGION4_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R1_R_S  6
/** HP_MEM_APM_REGION4_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_X    (BIT(8))
#define HP_MEM_APM_REGION4_R2_X_M  (HP_MEM_APM_REGION4_R2_X_V << HP_MEM_APM_REGION4_R2_X_S)
#define HP_MEM_APM_REGION4_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_X_S  8
/** HP_MEM_APM_REGION4_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_W    (BIT(9))
#define HP_MEM_APM_REGION4_R2_W_M  (HP_MEM_APM_REGION4_R2_W_V << HP_MEM_APM_REGION4_R2_W_S)
#define HP_MEM_APM_REGION4_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_W_S  9
/** HP_MEM_APM_REGION4_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 4.
 */
#define HP_MEM_APM_REGION4_R2_R    (BIT(10))
#define HP_MEM_APM_REGION4_R2_R_M  (HP_MEM_APM_REGION4_R2_R_V << HP_MEM_APM_REGION4_R2_R_S)
#define HP_MEM_APM_REGION4_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION4_R2_R_S  10
/** HP_MEM_APM_REGION4_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 4.
 */
#define HP_MEM_APM_REGION4_TEE_X    (BIT(12))
#define HP_MEM_APM_REGION4_TEE_X_M  (HP_MEM_APM_REGION4_TEE_X_V << HP_MEM_APM_REGION4_TEE_X_S)
#define HP_MEM_APM_REGION4_TEE_X_V  0x00000001U
#define HP_MEM_APM_REGION4_TEE_X_S  12
/** HP_MEM_APM_REGION4_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 4.
 */
#define HP_MEM_APM_REGION4_TEE_W    (BIT(13))
#define HP_MEM_APM_REGION4_TEE_W_M  (HP_MEM_APM_REGION4_TEE_W_V << HP_MEM_APM_REGION4_TEE_W_S)
#define HP_MEM_APM_REGION4_TEE_W_V  0x00000001U
#define HP_MEM_APM_REGION4_TEE_W_S  13
/** HP_MEM_APM_REGION4_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 4.
 */
#define HP_MEM_APM_REGION4_TEE_R    (BIT(14))
#define HP_MEM_APM_REGION4_TEE_R_M  (HP_MEM_APM_REGION4_TEE_R_V << HP_MEM_APM_REGION4_TEE_R_S)
#define HP_MEM_APM_REGION4_TEE_R_V  0x00000001U
#define HP_MEM_APM_REGION4_TEE_R_S  14
/** HP_MEM_APM_REGION4_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION4_LOCK    (BIT(16))
#define HP_MEM_APM_REGION4_LOCK_M  (HP_MEM_APM_REGION4_LOCK_V << HP_MEM_APM_REGION4_LOCK_S)
#define HP_MEM_APM_REGION4_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION4_LOCK_S  16

/** HP_MEM_APM_REGION5_ADDR_START_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION5_ADDR_START_REG (DR_REG_HP_MEM_APM_BASE + 0x40)
/** HP_MEM_APM_REGION5_ADDR_START_L : HRO; bitpos: [6:0]; default: 0;
 *  Low 12 bit, start address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_START_L    0x0000007FU
#define HP_MEM_APM_REGION5_ADDR_START_L_M  (HP_MEM_APM_REGION5_ADDR_START_L_V << HP_MEM_APM_REGION5_ADDR_START_L_S)
#define HP_MEM_APM_REGION5_ADDR_START_L_V  0x0000007FU
#define HP_MEM_APM_REGION5_ADDR_START_L_S  0
/** HP_MEM_APM_REGION5_ADDR_START : R/W; bitpos: [18:7]; default: 0;
 *  Configures start address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_START    0x00000FFFU
#define HP_MEM_APM_REGION5_ADDR_START_M  (HP_MEM_APM_REGION5_ADDR_START_V << HP_MEM_APM_REGION5_ADDR_START_S)
#define HP_MEM_APM_REGION5_ADDR_START_V  0x00000FFFU
#define HP_MEM_APM_REGION5_ADDR_START_S  7
/** HP_MEM_APM_REGION5_ADDR_START_H : HRO; bitpos: [31:19]; default: 1504;
 *  High 13 bit,  start address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_START_H    0x00001FFFU
#define HP_MEM_APM_REGION5_ADDR_START_H_M  (HP_MEM_APM_REGION5_ADDR_START_H_V << HP_MEM_APM_REGION5_ADDR_START_H_S)
#define HP_MEM_APM_REGION5_ADDR_START_H_V  0x00001FFFU
#define HP_MEM_APM_REGION5_ADDR_START_H_S  19

/** HP_MEM_APM_REGION5_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION5_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x44)
/** HP_MEM_APM_REGION5_ADDR_END_L : HRO; bitpos: [6:0]; default: 127;
 *  Low 12 bit, end address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_END_L    0x0000007FU
#define HP_MEM_APM_REGION5_ADDR_END_L_M  (HP_MEM_APM_REGION5_ADDR_END_L_V << HP_MEM_APM_REGION5_ADDR_END_L_S)
#define HP_MEM_APM_REGION5_ADDR_END_L_V  0x0000007FU
#define HP_MEM_APM_REGION5_ADDR_END_L_S  0
/** HP_MEM_APM_REGION5_ADDR_END : R/W; bitpos: [18:7]; default: 4095;
 *  Configures end address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_END    0x00000FFFU
#define HP_MEM_APM_REGION5_ADDR_END_M  (HP_MEM_APM_REGION5_ADDR_END_V << HP_MEM_APM_REGION5_ADDR_END_S)
#define HP_MEM_APM_REGION5_ADDR_END_V  0x00000FFFU
#define HP_MEM_APM_REGION5_ADDR_END_S  7
/** HP_MEM_APM_REGION5_ADDR_END_H : HRO; bitpos: [31:19]; default: 1504;
 *  High 13 bit,  end address of region 5.
 */
#define HP_MEM_APM_REGION5_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION5_ADDR_END_H_M  (HP_MEM_APM_REGION5_ADDR_END_H_V << HP_MEM_APM_REGION5_ADDR_END_H_S)
#define HP_MEM_APM_REGION5_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION5_ADDR_END_H_S  19

/** HP_MEM_APM_REGION5_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION5_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x48)
/** HP_MEM_APM_REGION5_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 5.
 */
#define HP_MEM_APM_REGION5_R0_X    (BIT(0))
#define HP_MEM_APM_REGION5_R0_X_M  (HP_MEM_APM_REGION5_R0_X_V << HP_MEM_APM_REGION5_R0_X_S)
#define HP_MEM_APM_REGION5_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION5_R0_X_S  0
/** HP_MEM_APM_REGION5_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 5.
 */
#define HP_MEM_APM_REGION5_R0_W    (BIT(1))
#define HP_MEM_APM_REGION5_R0_W_M  (HP_MEM_APM_REGION5_R0_W_V << HP_MEM_APM_REGION5_R0_W_S)
#define HP_MEM_APM_REGION5_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION5_R0_W_S  1
/** HP_MEM_APM_REGION5_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 5.
 */
#define HP_MEM_APM_REGION5_R0_R    (BIT(2))
#define HP_MEM_APM_REGION5_R0_R_M  (HP_MEM_APM_REGION5_R0_R_V << HP_MEM_APM_REGION5_R0_R_S)
#define HP_MEM_APM_REGION5_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION5_R0_R_S  2
/** HP_MEM_APM_REGION5_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 5.
 */
#define HP_MEM_APM_REGION5_R1_X    (BIT(4))
#define HP_MEM_APM_REGION5_R1_X_M  (HP_MEM_APM_REGION5_R1_X_V << HP_MEM_APM_REGION5_R1_X_S)
#define HP_MEM_APM_REGION5_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION5_R1_X_S  4
/** HP_MEM_APM_REGION5_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 5.
 */
#define HP_MEM_APM_REGION5_R1_W    (BIT(5))
#define HP_MEM_APM_REGION5_R1_W_M  (HP_MEM_APM_REGION5_R1_W_V << HP_MEM_APM_REGION5_R1_W_S)
#define HP_MEM_APM_REGION5_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION5_R1_W_S  5
/** HP_MEM_APM_REGION5_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 5.
 */
#define HP_MEM_APM_REGION5_R1_R    (BIT(6))
#define HP_MEM_APM_REGION5_R1_R_M  (HP_MEM_APM_REGION5_R1_R_V << HP_MEM_APM_REGION5_R1_R_S)
#define HP_MEM_APM_REGION5_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION5_R1_R_S  6
/** HP_MEM_APM_REGION5_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 5.
 */
#define HP_MEM_APM_REGION5_R2_X    (BIT(8))
#define HP_MEM_APM_REGION5_R2_X_M  (HP_MEM_APM_REGION5_R2_X_V << HP_MEM_APM_REGION5_R2_X_S)
#define HP_MEM_APM_REGION5_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION5_R2_X_S  8
/** HP_MEM_APM_REGION5_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 5.
 */
#define HP_MEM_APM_REGION5_R2_W    (BIT(9))
#define HP_MEM_APM_REGION5_R2_W_M  (HP_MEM_APM_REGION5_R2_W_V << HP_MEM_APM_REGION5_R2_W_S)
#define HP_MEM_APM_REGION5_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION5_R2_W_S  9
/** HP_MEM_APM_REGION5_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 5.
 */
#define HP_MEM_APM_REGION5_R2_R    (BIT(10))
#define HP_MEM_APM_REGION5_R2_R_M  (HP_MEM_APM_REGION5_R2_R_V << HP_MEM_APM_REGION5_R2_R_S)
#define HP_MEM_APM_REGION5_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION5_R2_R_S  10
/** HP_MEM_APM_REGION5_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 5.
 */
#define HP_MEM_APM_REGION5_TEE_X    (BIT(12))
#define HP_MEM_APM_REGION5_TEE_X_M  (HP_MEM_APM_REGION5_TEE_X_V << HP_MEM_APM_REGION5_TEE_X_S)
#define HP_MEM_APM_REGION5_TEE_X_V  0x00000001U
#define HP_MEM_APM_REGION5_TEE_X_S  12
/** HP_MEM_APM_REGION5_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 5.
 */
#define HP_MEM_APM_REGION5_TEE_W    (BIT(13))
#define HP_MEM_APM_REGION5_TEE_W_M  (HP_MEM_APM_REGION5_TEE_W_V << HP_MEM_APM_REGION5_TEE_W_S)
#define HP_MEM_APM_REGION5_TEE_W_V  0x00000001U
#define HP_MEM_APM_REGION5_TEE_W_S  13
/** HP_MEM_APM_REGION5_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 5.
 */
#define HP_MEM_APM_REGION5_TEE_R    (BIT(14))
#define HP_MEM_APM_REGION5_TEE_R_M  (HP_MEM_APM_REGION5_TEE_R_V << HP_MEM_APM_REGION5_TEE_R_S)
#define HP_MEM_APM_REGION5_TEE_R_V  0x00000001U
#define HP_MEM_APM_REGION5_TEE_R_S  14
/** HP_MEM_APM_REGION5_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION5_LOCK    (BIT(16))
#define HP_MEM_APM_REGION5_LOCK_M  (HP_MEM_APM_REGION5_LOCK_V << HP_MEM_APM_REGION5_LOCK_S)
#define HP_MEM_APM_REGION5_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION5_LOCK_S  16

/** HP_MEM_APM_REGION6_ADDR_START_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION6_ADDR_START_REG (DR_REG_HP_MEM_APM_BASE + 0x4c)
/** HP_MEM_APM_REGION6_ADDR_START_L : HRO; bitpos: [6:0]; default: 0;
 *  Low 12 bit, start address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_START_L    0x0000007FU
#define HP_MEM_APM_REGION6_ADDR_START_L_M  (HP_MEM_APM_REGION6_ADDR_START_L_V << HP_MEM_APM_REGION6_ADDR_START_L_S)
#define HP_MEM_APM_REGION6_ADDR_START_L_V  0x0000007FU
#define HP_MEM_APM_REGION6_ADDR_START_L_S  0
/** HP_MEM_APM_REGION6_ADDR_START : R/W; bitpos: [18:7]; default: 0;
 *  Configures start address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_START    0x00000FFFU
#define HP_MEM_APM_REGION6_ADDR_START_M  (HP_MEM_APM_REGION6_ADDR_START_V << HP_MEM_APM_REGION6_ADDR_START_S)
#define HP_MEM_APM_REGION6_ADDR_START_V  0x00000FFFU
#define HP_MEM_APM_REGION6_ADDR_START_S  7
/** HP_MEM_APM_REGION6_ADDR_START_H : HRO; bitpos: [31:19]; default: 1504;
 *  High 13 bit,  start address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_START_H    0x00001FFFU
#define HP_MEM_APM_REGION6_ADDR_START_H_M  (HP_MEM_APM_REGION6_ADDR_START_H_V << HP_MEM_APM_REGION6_ADDR_START_H_S)
#define HP_MEM_APM_REGION6_ADDR_START_H_V  0x00001FFFU
#define HP_MEM_APM_REGION6_ADDR_START_H_S  19

/** HP_MEM_APM_REGION6_ADDR_END_REG register
 *  Region address register
 */
#define HP_MEM_APM_REGION6_ADDR_END_REG (DR_REG_HP_MEM_APM_BASE + 0x50)
/** HP_MEM_APM_REGION6_ADDR_END_L : HRO; bitpos: [6:0]; default: 127;
 *  Low 12 bit, end address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_END_L    0x0000007FU
#define HP_MEM_APM_REGION6_ADDR_END_L_M  (HP_MEM_APM_REGION6_ADDR_END_L_V << HP_MEM_APM_REGION6_ADDR_END_L_S)
#define HP_MEM_APM_REGION6_ADDR_END_L_V  0x0000007FU
#define HP_MEM_APM_REGION6_ADDR_END_L_S  0
/** HP_MEM_APM_REGION6_ADDR_END : R/W; bitpos: [18:7]; default: 4095;
 *  Configures end address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_END    0x00000FFFU
#define HP_MEM_APM_REGION6_ADDR_END_M  (HP_MEM_APM_REGION6_ADDR_END_V << HP_MEM_APM_REGION6_ADDR_END_S)
#define HP_MEM_APM_REGION6_ADDR_END_V  0x00000FFFU
#define HP_MEM_APM_REGION6_ADDR_END_S  7
/** HP_MEM_APM_REGION6_ADDR_END_H : HRO; bitpos: [31:19]; default: 1504;
 *  High 13 bit,  end address of region 6.
 */
#define HP_MEM_APM_REGION6_ADDR_END_H    0x00001FFFU
#define HP_MEM_APM_REGION6_ADDR_END_H_M  (HP_MEM_APM_REGION6_ADDR_END_H_V << HP_MEM_APM_REGION6_ADDR_END_H_S)
#define HP_MEM_APM_REGION6_ADDR_END_H_V  0x00001FFFU
#define HP_MEM_APM_REGION6_ADDR_END_H_S  19

