espressif/esp-idf/components/soc/esp32s31/register/soc/hp_mem_apm_reg.h
/** HP_MEM_APM_REGION7_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_MEM_APM_REGION7_ATTR_REG (DR_REG_HP_MEM_APM_BASE + 0x60)
/** HP_MEM_APM_REGION7_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 7.
 */
#define HP_MEM_APM_REGION7_R0_X    (BIT(0))
#define HP_MEM_APM_REGION7_R0_X_M  (HP_MEM_APM_REGION7_R0_X_V << HP_MEM_APM_REGION7_R0_X_S)
#define HP_MEM_APM_REGION7_R0_X_V  0x00000001U
#define HP_MEM_APM_REGION7_R0_X_S  0
/** HP_MEM_APM_REGION7_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 7.
 */
#define HP_MEM_APM_REGION7_R0_W    (BIT(1))
#define HP_MEM_APM_REGION7_R0_W_M  (HP_MEM_APM_REGION7_R0_W_V << HP_MEM_APM_REGION7_R0_W_S)
#define HP_MEM_APM_REGION7_R0_W_V  0x00000001U
#define HP_MEM_APM_REGION7_R0_W_S  1
/** HP_MEM_APM_REGION7_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 7.
 */
#define HP_MEM_APM_REGION7_R0_R    (BIT(2))
#define HP_MEM_APM_REGION7_R0_R_M  (HP_MEM_APM_REGION7_R0_R_V << HP_MEM_APM_REGION7_R0_R_S)
#define HP_MEM_APM_REGION7_R0_R_V  0x00000001U
#define HP_MEM_APM_REGION7_R0_R_S  2
/** HP_MEM_APM_REGION7_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 7.
 */
#define HP_MEM_APM_REGION7_R1_X    (BIT(4))
#define HP_MEM_APM_REGION7_R1_X_M  (HP_MEM_APM_REGION7_R1_X_V << HP_MEM_APM_REGION7_R1_X_S)
#define HP_MEM_APM_REGION7_R1_X_V  0x00000001U
#define HP_MEM_APM_REGION7_R1_X_S  4
/** HP_MEM_APM_REGION7_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 7.
 */
#define HP_MEM_APM_REGION7_R1_W    (BIT(5))
#define HP_MEM_APM_REGION7_R1_W_M  (HP_MEM_APM_REGION7_R1_W_V << HP_MEM_APM_REGION7_R1_W_S)
#define HP_MEM_APM_REGION7_R1_W_V  0x00000001U
#define HP_MEM_APM_REGION7_R1_W_S  5
/** HP_MEM_APM_REGION7_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 7.
 */
#define HP_MEM_APM_REGION7_R1_R    (BIT(6))
#define HP_MEM_APM_REGION7_R1_R_M  (HP_MEM_APM_REGION7_R1_R_V << HP_MEM_APM_REGION7_R1_R_S)
#define HP_MEM_APM_REGION7_R1_R_V  0x00000001U
#define HP_MEM_APM_REGION7_R1_R_S  6
/** HP_MEM_APM_REGION7_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 7.
 */
#define HP_MEM_APM_REGION7_R2_X    (BIT(8))
#define HP_MEM_APM_REGION7_R2_X_M  (HP_MEM_APM_REGION7_R2_X_V << HP_MEM_APM_REGION7_R2_X_S)
#define HP_MEM_APM_REGION7_R2_X_V  0x00000001U
#define HP_MEM_APM_REGION7_R2_X_S  8
/** HP_MEM_APM_REGION7_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 7.
 */
#define HP_MEM_APM_REGION7_R2_W    (BIT(9))
#define HP_MEM_APM_REGION7_R2_W_M  (HP_MEM_APM_REGION7_R2_W_V << HP_MEM_APM_REGION7_R2_W_S)
#define HP_MEM_APM_REGION7_R2_W_V  0x00000001U
#define HP_MEM_APM_REGION7_R2_W_S  9
/** HP_MEM_APM_REGION7_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 7.
 */
#define HP_MEM_APM_REGION7_R2_R    (BIT(10))
#define HP_MEM_APM_REGION7_R2_R_M  (HP_MEM_APM_REGION7_R2_R_V << HP_MEM_APM_REGION7_R2_R_S)
#define HP_MEM_APM_REGION7_R2_R_V  0x00000001U
#define HP_MEM_APM_REGION7_R2_R_S  10
/** HP_MEM_APM_REGION7_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 7.
 */
#define HP_MEM_APM_REGION7_TEE_X    (BIT(12))
#define HP_MEM_APM_REGION7_TEE_X_M  (HP_MEM_APM_REGION7_TEE_X_V << HP_MEM_APM_REGION7_TEE_X_S)
#define HP_MEM_APM_REGION7_TEE_X_V  0x00000001U
#define HP_MEM_APM_REGION7_TEE_X_S  12
/** HP_MEM_APM_REGION7_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 7.
 */
#define HP_MEM_APM_REGION7_TEE_W    (BIT(13))
#define HP_MEM_APM_REGION7_TEE_W_M  (HP_MEM_APM_REGION7_TEE_W_V << HP_MEM_APM_REGION7_TEE_W_S)
#define HP_MEM_APM_REGION7_TEE_W_V  0x00000001U
#define HP_MEM_APM_REGION7_TEE_W_S  13
/** HP_MEM_APM_REGION7_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 7.
 */
#define HP_MEM_APM_REGION7_TEE_R    (BIT(14))
#define HP_MEM_APM_REGION7_TEE_R_M  (HP_MEM_APM_REGION7_TEE_R_V << HP_MEM_APM_REGION7_TEE_R_S)
#define HP_MEM_APM_REGION7_TEE_R_V  0x00000001U
#define HP_MEM_APM_REGION7_TEE_R_S  14
/** HP_MEM_APM_REGION7_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define HP_MEM_APM_REGION7_LOCK    (BIT(16))
#define HP_MEM_APM_REGION7_LOCK_M  (HP_MEM_APM_REGION7_LOCK_V << HP_MEM_APM_REGION7_LOCK_S)
#define HP_MEM_APM_REGION7_LOCK_V  0x00000001U
#define HP_MEM_APM_REGION7_LOCK_S  16

/** HP_MEM_APM_FUNC_CTRL_REG register
 *  APM function control register
 */
#define HP_MEM_APM_FUNC_CTRL_REG (DR_REG_HP_MEM_APM_BASE + 0xc4)
/** HP_MEM_APM_M0_FUNC_EN : R/W; bitpos: [0]; default: 1;
 *  PMS M0 function enable
 */
#define HP_MEM_APM_M0_FUNC_EN    (BIT(0))
#define HP_MEM_APM_M0_FUNC_EN_M  (HP_MEM_APM_M0_FUNC_EN_V << HP_MEM_APM_M0_FUNC_EN_S)
#define HP_MEM_APM_M0_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M0_FUNC_EN_S  0
/** HP_MEM_APM_M1_FUNC_EN : R/W; bitpos: [1]; default: 1;
 *  PMS M1 function enable
 */
#define HP_MEM_APM_M1_FUNC_EN    (BIT(1))
#define HP_MEM_APM_M1_FUNC_EN_M  (HP_MEM_APM_M1_FUNC_EN_V << HP_MEM_APM_M1_FUNC_EN_S)
#define HP_MEM_APM_M1_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M1_FUNC_EN_S  1
/** HP_MEM_APM_M2_FUNC_EN : R/W; bitpos: [2]; default: 1;
 *  PMS M2 function enable
 */
#define HP_MEM_APM_M2_FUNC_EN    (BIT(2))
#define HP_MEM_APM_M2_FUNC_EN_M  (HP_MEM_APM_M2_FUNC_EN_V << HP_MEM_APM_M2_FUNC_EN_S)
#define HP_MEM_APM_M2_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M2_FUNC_EN_S  2
/** HP_MEM_APM_M3_FUNC_EN : R/W; bitpos: [3]; default: 1;
 *  PMS M3 function enable
 */
#define HP_MEM_APM_M3_FUNC_EN    (BIT(3))
#define HP_MEM_APM_M3_FUNC_EN_M  (HP_MEM_APM_M3_FUNC_EN_V << HP_MEM_APM_M3_FUNC_EN_S)
#define HP_MEM_APM_M3_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M3_FUNC_EN_S  3
/** HP_MEM_APM_M4_FUNC_EN : R/W; bitpos: [4]; default: 1;
 *  PMS M4 function enable
 */
#define HP_MEM_APM_M4_FUNC_EN    (BIT(4))
#define HP_MEM_APM_M4_FUNC_EN_M  (HP_MEM_APM_M4_FUNC_EN_V << HP_MEM_APM_M4_FUNC_EN_S)
#define HP_MEM_APM_M4_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M4_FUNC_EN_S  4
/** HP_MEM_APM_M5_FUNC_EN : R/W; bitpos: [5]; default: 1;
 *  PMS M5 function enable
 */
#define HP_MEM_APM_M5_FUNC_EN    (BIT(5))
#define HP_MEM_APM_M5_FUNC_EN_M  (HP_MEM_APM_M5_FUNC_EN_V << HP_MEM_APM_M5_FUNC_EN_S)
#define HP_MEM_APM_M5_FUNC_EN_V  0x00000001U
#define HP_MEM_APM_M5_FUNC_EN_S  5

/** HP_MEM_APM_M0_STATUS_REG register
 *  M0 status register
 */
#define HP_MEM_APM_M0_STATUS_REG (DR_REG_HP_MEM_APM_BASE + 0xc8)
/** HP_MEM_APM_M0_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define HP_MEM_APM_M0_EXCEPTION_STATUS    0x00000003U
#define HP_MEM_APM_M0_EXCEPTION_STATUS_M  (HP_MEM_APM_M0_EXCEPTION_STATUS_V << HP_MEM_APM_M0_EXCEPTION_STATUS_S)
#define HP_MEM_APM_M0_EXCEPTION_STATUS_V  0x00000003U
#define HP_MEM_APM_M0_EXCEPTION_STATUS_S  0

