espressif/esp-idf/components/soc/esp32s31/register/soc/hp_mem_apm_reg.h
/** HP_MEM_APM_M2_EXCEPTION_INFO0_REG register
 *  M2 exception_info0 register
 */
#define HP_MEM_APM_M2_EXCEPTION_INFO0_REG (DR_REG_HP_MEM_APM_BASE + 0xf0)
/** HP_MEM_APM_M2_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define HP_MEM_APM_M2_EXCEPTION_REGION    0x000000FFU
#define HP_MEM_APM_M2_EXCEPTION_REGION_M  (HP_MEM_APM_M2_EXCEPTION_REGION_V << HP_MEM_APM_M2_EXCEPTION_REGION_S)
#define HP_MEM_APM_M2_EXCEPTION_REGION_V  0x000000FFU
#define HP_MEM_APM_M2_EXCEPTION_REGION_S  0
/** HP_MEM_APM_M2_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define HP_MEM_APM_M2_EXCEPTION_MODE    0x00000003U
#define HP_MEM_APM_M2_EXCEPTION_MODE_M  (HP_MEM_APM_M2_EXCEPTION_MODE_V << HP_MEM_APM_M2_EXCEPTION_MODE_S)
#define HP_MEM_APM_M2_EXCEPTION_MODE_V  0x00000003U
#define HP_MEM_APM_M2_EXCEPTION_MODE_S  16
/** HP_MEM_APM_M2_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents exception id information.
 */
#define HP_MEM_APM_M2_EXCEPTION_ID    0x0000001FU
#define HP_MEM_APM_M2_EXCEPTION_ID_M  (HP_MEM_APM_M2_EXCEPTION_ID_V << HP_MEM_APM_M2_EXCEPTION_ID_S)
#define HP_MEM_APM_M2_EXCEPTION_ID_V  0x0000001FU
#define HP_MEM_APM_M2_EXCEPTION_ID_S  18

/** HP_MEM_APM_M2_EXCEPTION_INFO1_REG register
 *  M2 exception_info1 register
 */
#define HP_MEM_APM_M2_EXCEPTION_INFO1_REG (DR_REG_HP_MEM_APM_BASE + 0xf4)
/** HP_MEM_APM_M2_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define HP_MEM_APM_M2_EXCEPTION_ADDR    0xFFFFFFFFU
#define HP_MEM_APM_M2_EXCEPTION_ADDR_M  (HP_MEM_APM_M2_EXCEPTION_ADDR_V << HP_MEM_APM_M2_EXCEPTION_ADDR_S)
#define HP_MEM_APM_M2_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define HP_MEM_APM_M2_EXCEPTION_ADDR_S  0

/** HP_MEM_APM_M3_STATUS_REG register
 *  M3 status register
 */
#define HP_MEM_APM_M3_STATUS_REG (DR_REG_HP_MEM_APM_BASE + 0xf8)
/** HP_MEM_APM_M3_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define HP_MEM_APM_M3_EXCEPTION_STATUS    0x00000003U
#define HP_MEM_APM_M3_EXCEPTION_STATUS_M  (HP_MEM_APM_M3_EXCEPTION_STATUS_V << HP_MEM_APM_M3_EXCEPTION_STATUS_S)
#define HP_MEM_APM_M3_EXCEPTION_STATUS_V  0x00000003U
#define HP_MEM_APM_M3_EXCEPTION_STATUS_S  0

/** HP_MEM_APM_M3_STATUS_CLR_REG register
 *  M3 status clear register
 */
#define HP_MEM_APM_M3_STATUS_CLR_REG (DR_REG_HP_MEM_APM_BASE + 0xfc)
/** HP_MEM_APM_M3_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define HP_MEM_APM_M3_EXCEPTION_STATUS_CLR    (BIT(0))
#define HP_MEM_APM_M3_EXCEPTION_STATUS_CLR_M  (HP_MEM_APM_M3_EXCEPTION_STATUS_CLR_V << HP_MEM_APM_M3_EXCEPTION_STATUS_CLR_S)
#define HP_MEM_APM_M3_EXCEPTION_STATUS_CLR_V  0x00000001U
#define HP_MEM_APM_M3_EXCEPTION_STATUS_CLR_S  0

/** HP_MEM_APM_M3_EXCEPTION_INFO0_REG register
 *  M3 exception_info0 register
 */
#define HP_MEM_APM_M3_EXCEPTION_INFO0_REG (DR_REG_HP_MEM_APM_BASE + 0x100)
/** HP_MEM_APM_M3_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define HP_MEM_APM_M3_EXCEPTION_REGION    0x000000FFU
#define HP_MEM_APM_M3_EXCEPTION_REGION_M  (HP_MEM_APM_M3_EXCEPTION_REGION_V << HP_MEM_APM_M3_EXCEPTION_REGION_S)
#define HP_MEM_APM_M3_EXCEPTION_REGION_V  0x000000FFU
#define HP_MEM_APM_M3_EXCEPTION_REGION_S  0
/** HP_MEM_APM_M3_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define HP_MEM_APM_M3_EXCEPTION_MODE    0x00000003U
#define HP_MEM_APM_M3_EXCEPTION_MODE_M  (HP_MEM_APM_M3_EXCEPTION_MODE_V << HP_MEM_APM_M3_EXCEPTION_MODE_S)
#define HP_MEM_APM_M3_EXCEPTION_MODE_V  0x00000003U
#define HP_MEM_APM_M3_EXCEPTION_MODE_S  16
/** HP_MEM_APM_M3_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents exception id information.
 */
#define HP_MEM_APM_M3_EXCEPTION_ID    0x0000001FU
#define HP_MEM_APM_M3_EXCEPTION_ID_M  (HP_MEM_APM_M3_EXCEPTION_ID_V << HP_MEM_APM_M3_EXCEPTION_ID_S)
#define HP_MEM_APM_M3_EXCEPTION_ID_V  0x0000001FU
#define HP_MEM_APM_M3_EXCEPTION_ID_S  18

/** HP_MEM_APM_M3_EXCEPTION_INFO1_REG register
 *  M3 exception_info1 register
 */
#define HP_MEM_APM_M3_EXCEPTION_INFO1_REG (DR_REG_HP_MEM_APM_BASE + 0x104)
/** HP_MEM_APM_M3_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define HP_MEM_APM_M3_EXCEPTION_ADDR    0xFFFFFFFFU
#define HP_MEM_APM_M3_EXCEPTION_ADDR_M  (HP_MEM_APM_M3_EXCEPTION_ADDR_V << HP_MEM_APM_M3_EXCEPTION_ADDR_S)
#define HP_MEM_APM_M3_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define HP_MEM_APM_M3_EXCEPTION_ADDR_S  0

/** HP_MEM_APM_M4_STATUS_REG register
 *  M4 status register
 */
#define HP_MEM_APM_M4_STATUS_REG (DR_REG_HP_MEM_APM_BASE + 0x108)
/** HP_MEM_APM_M4_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define HP_MEM_APM_M4_EXCEPTION_STATUS    0x00000003U
#define HP_MEM_APM_M4_EXCEPTION_STATUS_M  (HP_MEM_APM_M4_EXCEPTION_STATUS_V << HP_MEM_APM_M4_EXCEPTION_STATUS_S)
#define HP_MEM_APM_M4_EXCEPTION_STATUS_V  0x00000003U
#define HP_MEM_APM_M4_EXCEPTION_STATUS_S  0

/** HP_MEM_APM_M4_STATUS_CLR_REG register
 *  M4 status clear register
 */
#define HP_MEM_APM_M4_STATUS_CLR_REG (DR_REG_HP_MEM_APM_BASE + 0x10c)
/** HP_MEM_APM_M4_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define HP_MEM_APM_M4_EXCEPTION_STATUS_CLR    (BIT(0))
#define HP_MEM_APM_M4_EXCEPTION_STATUS_CLR_M  (HP_MEM_APM_M4_EXCEPTION_STATUS_CLR_V << HP_MEM_APM_M4_EXCEPTION_STATUS_CLR_S)
#define HP_MEM_APM_M4_EXCEPTION_STATUS_CLR_V  0x00000001U
#define HP_MEM_APM_M4_EXCEPTION_STATUS_CLR_S  0

/** HP_MEM_APM_M4_EXCEPTION_INFO0_REG register
 *  M4 exception_info0 register
 */
#define HP_MEM_APM_M4_EXCEPTION_INFO0_REG (DR_REG_HP_MEM_APM_BASE + 0x110)
/** HP_MEM_APM_M4_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define HP_MEM_APM_M4_EXCEPTION_REGION    0x000000FFU
#define HP_MEM_APM_M4_EXCEPTION_REGION_M  (HP_MEM_APM_M4_EXCEPTION_REGION_V << HP_MEM_APM_M4_EXCEPTION_REGION_S)
#define HP_MEM_APM_M4_EXCEPTION_REGION_V  0x000000FFU
#define HP_MEM_APM_M4_EXCEPTION_REGION_S  0
/** HP_MEM_APM_M4_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define HP_MEM_APM_M4_EXCEPTION_MODE    0x00000003U
#define HP_MEM_APM_M4_EXCEPTION_MODE_M  (HP_MEM_APM_M4_EXCEPTION_MODE_V << HP_MEM_APM_M4_EXCEPTION_MODE_S)
#define HP_MEM_APM_M4_EXCEPTION_MODE_V  0x00000003U
#define HP_MEM_APM_M4_EXCEPTION_MODE_S  16
/** HP_MEM_APM_M4_EXCEPTION_ID : RO; bitpos: [24:18]; default: 0;
 *  Represents exception id information.
 */
#define HP_MEM_APM_M4_EXCEPTION_ID    0x0000007FU
#define HP_MEM_APM_M4_EXCEPTION_ID_M  (HP_MEM_APM_M4_EXCEPTION_ID_V << HP_MEM_APM_M4_EXCEPTION_ID_S)
#define HP_MEM_APM_M4_EXCEPTION_ID_V  0x0000007FU
#define HP_MEM_APM_M4_EXCEPTION_ID_S  18

/** HP_MEM_APM_M4_EXCEPTION_INFO1_REG register
 *  M4 exception_info1 register
 */
#define HP_MEM_APM_M4_EXCEPTION_INFO1_REG (DR_REG_HP_MEM_APM_BASE + 0x114)
/** HP_MEM_APM_M4_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define HP_MEM_APM_M4_EXCEPTION_ADDR    0xFFFFFFFFU
#define HP_MEM_APM_M4_EXCEPTION_ADDR_M  (HP_MEM_APM_M4_EXCEPTION_ADDR_V << HP_MEM_APM_M4_EXCEPTION_ADDR_S)
#define HP_MEM_APM_M4_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define HP_MEM_APM_M4_EXCEPTION_ADDR_S  0

